reports/333-go.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.757ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.751ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.746ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.87ms    7.55ms 174.98ms   99.03%
    Req/Sec     3.53k     0.87k   34.44k    98.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.67ms
 90.000%    2.01ms
 99.000%    6.86ms
 99.900%  126.97ms
 99.990%  168.70ms
 99.999%  173.82ms
100.000%  175.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.100     0.000000            1         1.00
       0.514     0.100000        49447         1.11
       0.693     0.200000        99138         1.25
       0.864     0.300000       148493         1.43
       1.034     0.400000       197942         1.67
       1.209     0.500000       247385         2.00
       1.299     0.550000       272024         2.22
       1.391     0.600000       296790         2.50
       1.484     0.650000       321521         2.86
       1.578     0.700000       346179         3.33
       1.674     0.750000       370913         4.00
       1.723     0.775000       383203         4.44
       1.773     0.800000       395727         5.00
       1.824     0.825000       407898         5.71
       1.880     0.850000       420289         6.67
       1.942     0.875000       432773         8.00
       1.976     0.887500       438903         8.89
       2.013     0.900000       445091        10.00
       2.053     0.912500       451182        11.43
       2.099     0.925000       457467        13.33
       2.151     0.937500       463689        16.00
       2.179     0.943750       466770        17.78
       2.209     0.950000       469751        20.00
       2.241     0.956250       472778        22.86
       2.277     0.962500       475969        26.67
       2.319     0.968750       479076        32.00
       2.343     0.971875       480626        35.56
       2.369     0.975000       482094        40.00
       2.401     0.978125       483604        45.71
       2.443     0.981250       485192        53.33
       2.499     0.984375       486711        64.00
       2.543     0.985938       487465        71.11
       2.625     0.987500       488220        80.00
       2.911     0.989062       488990        91.43
      11.727     0.990625       489763       106.67
      27.791     0.992188       490535       128.00
      36.767     0.992969       490923       142.22
      44.543     0.993750       491308       160.00
      54.047     0.994531       491696       182.86
      63.103     0.995313       492080       213.33
      71.871     0.996094       492467       256.00
      75.903     0.996484       492662       284.44
      80.959     0.996875       492853       320.00
      86.015     0.997266       493048       365.71
      91.199     0.997656       493240       426.67
      97.023     0.998047       493434       512.00
      99.839     0.998242       493532       568.89
     102.911     0.998437       493626       640.00
     111.807     0.998633       493723       731.43
     117.823     0.998828       493818       853.33
     128.191     0.999023       493915      1024.00
     132.735     0.999121       493963      1137.78
     137.727     0.999219       494011      1280.00
     142.079     0.999316       494060      1462.86
     144.383     0.999414       494109      1706.67
     149.759     0.999512       494158      2048.00
     151.935     0.999561       494181      2275.56
     154.367     0.999609       494204      2560.00
     156.927     0.999658       494229      2925.71
     158.975     0.999707       494254      3413.33
     161.663     0.999756       494277      4096.00
     163.327     0.999780       494291      4551.11
     164.351     0.999805       494302      5120.00
     165.375     0.999829       494313      5851.43
     166.655     0.999854       494325      6826.67
     167.935     0.999878       494339      8192.00
     168.319     0.999890       494343      9102.22
     168.703     0.999902       494349     10240.00
     169.727     0.999915       494355     11702.86
     169.983     0.999927       494361     13653.33
     171.007     0.999939       494368     16384.00
     171.135     0.999945       494370     18204.44
     171.775     0.999951       494373     20480.00
     172.159     0.999957       494378     23405.71
     172.415     0.999963       494380     27306.67
     172.671     0.999969       494383     32768.00
     172.927     0.999973       494385     36408.89
     172.927     0.999976       494385     40960.00
     173.055     0.999979       494387     46811.43
     173.183     0.999982       494389     54613.33
     173.439     0.999985       494391     65536.00
     173.439     0.999986       494391     72817.78
     173.439     0.999988       494391     81920.00
     173.823     0.999989       494392     93622.86
     173.951     0.999991       494393    109226.67
     174.079     0.999992       494394    131072.00
     174.079     0.999993       494394    145635.56
     174.079     0.999994       494394    163840.00
     174.463     0.999995       494395    187245.71
     174.463     0.999995       494395    218453.33
     174.975     0.999996       494396    262144.00
     174.975     0.999997       494396    291271.11
     174.975     0.999997       494396    327680.00
     174.975     0.999997       494396    374491.43
     174.975     0.999998       494396    436906.67
     175.103     0.999998       494397    524288.00
     175.103     1.000000       494397          inf
#[Mean    =        1.866, StdDeviation   =        7.550]
#[Max     =      174.976, Total count    =       494397]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597336 requests in 1.00m, 67.22MB read
Requests/sec:   9955.48
Transfer/sec:      1.12MB