reports/333-haskell.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.529ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.534ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.529ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.62ms    3.08ms  71.42ms   99.14%
    Req/Sec     3.54k     2.40k   17.90k    73.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.32ms
 75.000%    1.82ms
 90.000%    2.33ms
 99.000%    4.28ms
 99.900%   51.62ms
 99.990%   65.98ms
 99.999%   68.93ms
100.000%   71.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.101     0.000000            1         1.00
       0.560     0.100000        49591         1.11
       0.771     0.200000        99144         1.25
       0.954     0.300000       148370         1.43
       1.134     0.400000       197995         1.67
       1.318     0.500000       247262         2.00
       1.413     0.550000       272128         2.22
       1.508     0.600000       296909         2.50
       1.606     0.650000       321503         2.86
       1.709     0.700000       346160         3.33
       1.822     0.750000       370961         4.00
       1.883     0.775000       383291         4.44
       1.949     0.800000       395588         5.00
       2.023     0.825000       407976         5.71
       2.107     0.850000       420402         6.67
       2.205     0.875000       432709         8.00
       2.263     0.887500       438958         8.89
       2.329     0.900000       445146        10.00
       2.405     0.912500       451189        11.43
       2.499     0.925000       457467        13.33
       2.617     0.937500       463578        16.00
       2.685     0.943750       466645        17.78
       2.767     0.950000       469751        20.00
       2.863     0.956250       472859        22.86
       2.979     0.962500       475930        26.67
       3.115     0.968750       479028        32.00
       3.191     0.971875       480548        35.56
       3.281     0.975000       482121        40.00
       3.381     0.978125       483627        45.71
       3.507     0.981250       485173        53.33
       3.675     0.984375       486719        64.00
       3.787     0.985938       487489        71.11
       3.935     0.987500       488262        80.00
       4.127     0.989062       489043        91.43
       4.423     0.990625       489810       106.67
       5.347     0.992188       490579       128.00
       7.091     0.992969       490966       142.22
      12.631     0.993750       491351       160.00
      19.231     0.994531       491738       182.86
      26.639     0.995313       492124       213.33
      30.655     0.996094       492511       256.00
      32.991     0.996484       492705       284.44
      35.807     0.996875       492896       320.00
      38.751     0.997266       493091       365.71
      41.183     0.997656       493283       426.67
      43.615     0.998047       493478       512.00
      44.927     0.998242       493575       568.89
      46.719     0.998437       493670       640.00
      48.831     0.998633       493766       731.43
      50.559     0.998828       493865       853.33
      51.999     0.999023       493960      1024.00
      52.799     0.999121       494008      1137.78
      53.727     0.999219       494056      1280.00
      54.783     0.999316       494106      1462.86
      56.351     0.999414       494152      1706.67
      58.175     0.999512       494200      2048.00
      59.103     0.999561       494224      2275.56
      60.095     0.999609       494249      2560.00
      60.671     0.999658       494273      2925.71
      61.567     0.999707       494297      3413.33
      62.623     0.999756       494321      4096.00
      63.199     0.999780       494334      4551.11
      63.807     0.999805       494345      5120.00
      64.383     0.999829       494357      5851.43
      65.215     0.999854       494370      6826.67
      65.663     0.999878       494382      8192.00
      65.855     0.999890       494389      9102.22
      65.983     0.999902       494394     10240.00
      66.175     0.999915       494401     11702.86
      66.303     0.999927       494405     13653.33
      66.687     0.999939       494412     16384.00
      66.815     0.999945       494414     18204.44
      67.007     0.999951       494417     20480.00
      67.391     0.999957       494421     23405.71
      67.583     0.999963       494423     27306.67
      68.095     0.999969       494427     32768.00
      68.159     0.999973       494429     36408.89
      68.159     0.999976       494429     40960.00
      68.479     0.999979       494431     46811.43
      68.671     0.999982       494432     54613.33
      68.863     0.999985       494434     65536.00
      68.927     0.999986       494436     72817.78
      68.927     0.999988       494436     81920.00
      68.927     0.999989       494436     93622.86
      69.439     0.999991       494437    109226.67
      69.823     0.999992       494438    131072.00
      69.823     0.999993       494438    145635.56
      69.823     0.999994       494438    163840.00
      70.399     0.999995       494439    187245.71
      70.399     0.999995       494439    218453.33
      71.295     0.999996       494440    262144.00
      71.295     0.999997       494440    291271.11
      71.295     0.999997       494440    327680.00
      71.295     0.999997       494440    374491.43
      71.295     0.999998       494440    436906.67
      71.487     0.999998       494441    524288.00
      71.487     1.000000       494441          inf
#[Mean    =        1.625, StdDeviation   =        3.085]
#[Max     =       71.424, Total count    =       494441]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  594921 requests in 1.00m, 67.52MB read
Requests/sec:   9912.73
Transfer/sec:      1.12MB